<script setup lang="ts">
import { ref, onMounted } from 'vue'

const isDark = ref(false)

const toggleTheme = () => {
    isDark.value = !isDark.value
    const theme = isDark.value ? 'dark' : 'light'

    // Применяем тему к тегу html
    document.documentElement.setAttribute('data-theme', theme)
    // Сохраняем, чтобы после перезагрузки не слетало
    localStorage.setItem('theme', theme)
}

// При загрузке проверяем, что было выбрано ранее
onMounted(() => {
    const savedTheme = localStorage.getItem('theme')
    if (savedTheme === 'dark') {
        isDark.value = true
        document.documentElement.setAttribute('data-theme', 'dark')
    }
})

</script>

<template>
    <button class="theme-toggle" @click="toggleTheme">
        <svg v-if="!isDark" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M10.0001 1.04163C10.1658 1.04163 10.3248 1.10747 10.442 1.22468C10.5592 1.34189 10.6251 1.50087 10.6251 1.66663V2.49996C10.6251 2.66572 10.5592 2.82469 10.442 2.9419C10.3248 3.05911 10.1658 3.12496 10.0001 3.12496C9.83432 3.12496 9.67535 3.05911 9.55814 2.9419C9.44093 2.82469 9.37508 2.66572 9.37508 2.49996V1.66663C9.37508 1.50087 9.44093 1.34189 9.55814 1.22468C9.67535 1.10747 9.83432 1.04163 10.0001 1.04163Z" fill="currentColor"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M10.0001 4.37496C8.50824 4.37496 7.0775 4.96759 6.02261 6.02248C4.96771 7.07738 4.37508 8.50812 4.37508 9.99996C4.37508 11.4918 4.96771 12.9225 6.02261 13.9774C7.0775 15.0323 8.50824 15.625 10.0001 15.625C11.4919 15.625 12.9227 15.0323 13.9776 13.9774C15.0324 12.9225 15.6251 11.4918 15.6251 9.99996C15.6251 8.50812 15.0324 7.07738 13.9776 6.02248C12.9227 4.96759 11.4919 4.37496 10.0001 4.37496Z" fill="currentColor"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M1.04175 9.99996C1.04175 9.8342 1.1076 9.67523 1.22481 9.55802C1.34202 9.44081 1.50099 9.37496 1.66675 9.37496H2.50008C2.66584 9.37496 2.82481 9.44081 2.94202 9.55802C3.05923 9.67523 3.12508 9.8342 3.12508 9.99996C3.12508 10.1657 3.05923 10.3247 2.94202 10.4419C2.82481 10.5591 2.66584 10.625 2.50008 10.625H1.66675C1.50099 10.625 1.34202 10.5591 1.22481 10.4419C1.1076 10.3247 1.04175 10.1657 1.04175 9.99996Z" fill="currentColor"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M16.8751 9.99996C16.8751 9.8342 16.9409 9.67523 17.0581 9.55802C17.1754 9.44081 17.3343 9.37496 17.5001 9.37496H18.3334C18.4992 9.37496 18.6581 9.44081 18.7754 9.55802C18.8926 9.67523 18.9584 9.8342 18.9584 9.99996C18.9584 10.1657 18.8926 10.3247 18.7754 10.4419C18.6581 10.5591 18.4992 10.625 18.3334 10.625H17.5001C17.3343 10.625 17.1754 10.5591 17.0581 10.4419C16.9409 10.3247 16.8751 10.1657 16.8751 9.99996Z" fill="currentColor"/>
        </svg>
        <svg v-else width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M17.0891 11.9627C16.9906 13.8957 16.0891 15.6821 14.6098 16.8706C13.1305 18.0591 11.1676 18.5607 9.27094 18.2578C7.37432 17.955 5.7469 16.8745 4.81971 15.2764C3.89253 13.6783 3.74555 11.7486 4.42477 10.0487C5.10398 8.34877 6.4472 7.05378 8.08068 6.45919C8.27387 6.37973 8.49408 6.40532 8.66549 6.52819C8.8369 6.65106 8.93436 6.85368 8.92898 7.0657C8.92361 7.27772 8.8162 7.47387 8.6347 7.58979C7.38968 8.37879 6.49486 9.6298 6.26883 11.0618C6.04281 12.4937 6.51349 13.9376 7.54313 14.9858C8.57277 16.034 10.0393 16.5534 11.4876 16.3919C12.9358 16.2304 14.2467 15.3989 14.9876 14.1769C15.7285 12.9549 15.8289 11.4461 15.2606 10.1527C15.1358 9.86816 15.1571 9.53681 15.3167 9.27268C15.4762 9.00855 15.7556 8.84607 16.0544 8.8407C16.3532 8.83532 16.6378 8.98783 16.8057 9.24661C17.9041 11.0349 17.9819 13.3165 17.0891 11.9627Z" fill="currentColor"/>
        </svg>
    </button>
</template>

<style scoped>
.theme-toggle {
    height: 32px;
    width: 32px;
    background-color: var(--bg-secondary);
    border-radius: 999px;
    border: none;
    cursor: pointer;
    display: flex;
    align-items: center;
    justify-content: center;

    img {
        width: 20px;
        height: 20px;
        transition: filter 0.3s ease;
    }
}

[data-theme="dark"] .theme-toggle img {
    filter: invert(1);
}
</style>